ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/МП_КатегорииYML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_КатегорииYML</name>
  <resources>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>parentId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвитоПодкатегорияТоваров</name>
    <type>
      <types>CatalogRef.МП_АвитоПодкатегорииТоваров</types>
    </type>
  </resources>
  <dimensions>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнКар.Маркетплейсы/src/InformationRegisters/МП_КатегорииYML/ManagerModule.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает часть xml-файла с сформированным разделом по категориям
// 
//        <categories>
//            <category id="1">Бытовая техника</category>
//            <category id="10" parentId="1">Мелкая техника для кухни</category>
//            <category id="101" parentId="10">Сэндвичницы и приборы для выпечки</category>
//        </categories>
// 
// Возвращаемое значение:
//  
Функция РазделКатегорииМагазина(ДокументDOM) Экспорт

	РазделКатегорииМагазина = ДокументDOM.СоздатьЭлемент("categories");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	МП_КатегорииYML.id КАК id,
				   |	МП_КатегорииYML.parentId КАК parentId,
				   |	МП_КатегорииYML.Категория.Наименование КАК КатегорияНаименование
				   |ИЗ
				   |	РегистрСведений.МП_КатегорииYML КАК МП_КатегорииYML
				   |УПОРЯДОЧИТЬ ПО
				   |	id";
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Элемент = ДокументDOM.СоздатьЭлемент("category");
		Элемент.УстановитьАтрибут("id", Строка(Формат(Выборка.id, "ЧГ=0;")));
		Если Выборка.parentId <> 0 Тогда
			Элемент.УстановитьАтрибут("parentId", Строка(Формат(Выборка.parentId, "ЧГ=0;")));
		КонецЕсли;
		Элемент.ТекстовоеСодержимое = Выборка.КатегорияНаименование;

		РазделКатегорииМагазина.ДобавитьДочерний(Элемент);
		
	КонецЦикла;

	Возврат РазделКатегорииМагазина;

КонецФункции

#КонецОбласти

#КонецЕсли
